Repository: Piwigo/Piwigo-Mobile
Catalog: piwigo/Resources/ReleaseNotes.xcstrings
Source language: en
Languages: ar, da, de, es, fr, hu, id, it, ja, nl, pl, ru, sv, zh_hans, zh_hant

# v3.2.0_text
source: Version 3.2 July 14, 2024 • Adopts album photo sorting options • Adds on-the-fly photo sorting options • Adds rotation of uploaded photos (requires the rotateImage plugin) • Bug fixes
ar: الإصدار 3.2 14 يوليو 2024 • يعتمد خيارات فرز صور الألبوم • يُضيف خيارات فرز الصور أثناء التنقل • يضيف تدوير الصور التي تم تحميلها (يتطلب ملحق RotateImage) • إصلاح الأخطاء
da: Version 3.2 14 juli 2024 • Vedtager album foto sortering muligheder • Tilføjer on-the-fly foto sortering muligheder • Tilføjer rotation af uploadede fotos (kræver rotateImage plugin) • Fejlrettelser
de: Version 3.2 14. Juli 2024 • Übernimmt die Sortieroptionen für Albenfotos • Fügt Optionen für die fliegende Sortierung von Fotos hinzu • Rotation der hochgeladenen Fotos (erfordert das rotateImage-Plugin) • Fehlerbehebungen
es: Versión 3.2 14 de julio de 2024 • Adoptadas opciones de clasificación de las fotografías de un álbum • Añadidas opciones de clasificación de fotografías sobre la marcha • Añadida rotación de fotos cargadas • Corrección de errores
fr: Version 3.2 14 juillet 2024 • Adopte les options de tri des photos des albums • Ajoute des options de tri des photos à la volée • Ajoute la rotation des photos téléchargées (nécessite le plugin rotateImage) • Corrections de bugs
hu: 3.2-es verzió 2024 Július 14 • Elfogadta az album fotók rendezési lehetőségeit • Függőleges fotóválogatási lehetőségek hozzáadása • Hozzáadja a feltöltött fényképek forgatását • Hibajavítások
it: Versione 3.2 14 luglio 2024 • Adotta opzioni di ordinamento foto album • Aggiunge opzioni di ordinamento foto al volo • Aggiunge la rotazione delle foto caricate (richiede il plugin rotateimage) • Correzioni di bug
ja: バージョン3.2 2024年7月14日 • アルバム写真の並べ替えオプションを採用 • オンザフライ写真並べ替えオプションの追加 • アップロードした写真の回転機能を追加 • バグ修正
nl: Versie 3.2 14 juli 2024 • Voegt albumfoto sortering opties • Voegt op-the-fly foto sortering opties • Voegt rotatie van geüploade foto's toe (vereist de rotateImage plugin) • Foutjes verbeterd
pl: Wersja 3.2 14 lipca 2024 • Można dopasować opcje sortowania zdjęć w albumie • Dodaje opcje sortowania zdjęć w locie • Dodaje możliwość obracania przesyłanych zdjęć (wymagana wtyczka rotateImage) • Poprawki błędów
ru: Версия 3.2 14 июля 2024 • Принимает сортировку фото альбома • Добавляет параметры сортировки на лету • Добавляет поворот загруженных фотографий (требуется плагин rotateImage) • Исправления ошибок
sv: Version 3.2 14 juli 2024 • Antar sorteringsalternativ för albumfoto • Lägger till foton i farten sorteringsalternativ • Lägger till rotation av uppladdade bilder (kräver rotateImage plugin) • Felrättelser
zh_hans: 版本 3.2 2024年7月14日 • 通过相册照片排序选项 • 添加实时照片排序选项 • 增加上传照片的旋转(需要 rotateImage 插件) • Bug 修复
zh_hant: 版本 3.2 2024年7月14日 • 採用相簿圖片旋轉選項 • 添加即時(on-the-fly)圖片排序選項 • 新增旋轉上傳圖片的功能 • 錯誤修正

# v3.2.1_text
source: Version 3.2.1 July 29, 2024 • Adds an option to display albums with or without descriptions • Bug fixes
ar: الإصدار 3.2.1 29 يوليو 2024 • يضيف خيار لعرض الألبومات مع أو بدون الأوصاف • إصلاحات الشوائب
da: Version 3.2.1 29 juli 2024 • Tilføjer en mulighed for at vise album med eller uden beskrivelser • Fejlrettelser
de: Version 3.2.1 29. Juli 2024 • Fügt eine Option hinzu zum Anzeigen von Alben mit oder ohne Beschreibung • Fehlerbehebungen
es: Versión 3.2.1 29 de julio de 2024 • Añade una opción para mostrar los álbumes con o sin descripciones • Corrección de errores
fr: Version 3.2.1 29 juillet 2024 • Ajoute une option pour afficher les albums avec ou sans descriptions • Corrections de bugs
hu: 3.2.1-es verzió 2024 Július 29 • Lehetőséget ad az albumok megjelenítésére leírással vagy anélkül • Hibajavítások
it: Versione 3.2.1 29 luglio 2024 • Aggiunge un'opzione per visualizzare gli album con o senza descrizioni • Correzioni di bug
ja: バージョン 3.2.1 2024年7月29日 • アルバムを説明付きまたは説明なしで表示するオプションを追加 • バグ修正
nl: Versie 3.2.1 29 juli 2024 • Voegt een optie toe om albums met of zonder beschrijvingen weer te geven • Bugfixes
pl: Wersja 3.2.1 29 lipca 2024 • Dodaje opcję wyświetlania albumów z ich opisami lub bez opisów • Poprawki błędów
ru: Версия 3.2.1 29 июля 2024 • Добавлена ​​возможность отображать альбомы с описаниями или без них. • Исправление ошибок
sv: Version 3.2.1 29 juli 2024 • Lägger till ett alternativ för att visa album med eller utan beskrivningar • Bug fixar
zh_hans: 版本 3.2.1 2024年7月29日 • 添加显示带或不带描述的相册的选项 • 错误修复
zh_hant: 版本3.2.1 2024年7月29日 • 新增一個選項來顯示有或沒有說明的相冊 • 錯誤修正

# v3.2.2_text
source: Version 3.2.2 September 12, 2024 • Adds an option to delete selections of photos/videos stored in the device • Bug fixes
ar: الإصدار 3.2-2 12 سبتمبر 2024 • يضيف خيارا لحذف اختيارات الصور/الفيديوهات المخزنة في الجهاز • إصلاحات الشوائب
da: Version 3.2.2 12 september 2024 • Tilføjer en mulighed for at slette udvalgte fotos/videoer, der er gemt på enheden • Fejlrettelser
de: Version 3.2.2 12. September 2024 • Fügt eine Option zum Löschen einer Auswahl von auf dem Gerät gespeicherten Fotos/Videos hinzu • Fehlerbehebungen
es: Versión 3.2.2 12 de septiembre de 2024 • Añade una opción para borrar selecciones de fotos/vídeos almacenados en el dispositivo • Corrección de errores
fr: Version 3.2.2 12 septembre 2024 • Ajout d'une option pour supprimer les sélections de photos/vidéos stockées dans l'appareil • Correction de bugs
hu: 3.2.2-es verzió 2024 Szeptember 12 • Lehetőséget ad a készülékben tárolt fényképek/videók kiválasztásának törlésére • Hibajavítások
it: Versione 3.2.2 12 settembre 2024 • Aggiunge un'opzione per eliminare le selezioni di foto/video memorizzate nel dispositivo • Correzioni di bug
ja: バージョン3.2.2 2024年9月12日 • デバイスに保存されている写真/ビデオの選択を削除するオプションを追加しました。 • バグ修正
nl: Versie 3.2.2 12 september 2024 • Optie toegevoegd voor het verwijderen van selecties van foto's/video's die op het apparaat zijn opgeslagen • Bug fixes
pl: Wersja 3.2.2 12 września 2024 • Dodano opcję usuwania wybranych zdjęć/filmów zapisanych w urządzeniu • Poprawki błędów
ru: Версия 3.2.2 12 сентября 2024 • Добавлена возможность удаления избранных фотографий/видео, хранящихся на устройстве • Исправления ошибок
sv: Version 3.2.2 12 september 2024 • Lägger till ett alternativ för att radera urval av foton/videor som lagrats i enheten • Buggfixar
zh_hans: 版本 3.2.2 2024年9月12日 • 添加删除存储在设备中的照片/视频选项 • 修正错误
zh_hant: 版本 3.2.2 2024年9月12日 • 新增刪除儲存於裝置中的相片/影片選項 • 修正錯誤

# v3.2.3_text
source: Version 3.2.3 October 17, 2024 • Bug fixes
ar: الإصدار 3.2.3 17 أكتوبر 2024 - إصلاحات الأخطاء
da: Version 3.2.3 17 oktober 2024 • Fejlrettelser
de: Version 3.2.3 17. Oktober 2024 • Fehlerbehebungen
es: Versión 3.2.3 17 de octubre de 2024 • Corrección de errores
fr: Version 3.2.3 17 octobre 2024 • Correction de bugs
hu: 3.2.3-es verzió 2024 Október 17 • Hibajavítások
id: Versi 3.2.3 17 Oktober 2024 • Perbaikan bug
it: Versione 3.2.3 17 ottobre 2024 • Correzioni di bug
ja: バージョン 3.2.3 2024年10月17日 • バグの修正
nl: Versie 3.2.3 17 oktober 2024 • Foutjes verbeterd
pl: Wersja 3.2.3 17 października 2024 • Poprawki błędów
ru: Версия 3.2.3 17 октября 2024 • Исправления ошибок
sv: Version 3.2.3 17 oktober 2024 • Buggfixar
zh_hans: 版本 3.2.3 2024年10月17日 • 错误修复
zh_hant: 版本 3.2.3 2024年10月17日 • 錯誤修正

# v3.2.4_text
source: Version 3.2.4 January 18, 2025 • Minor bug fixes and improvements of the interface
ar: الإصدار 3.2.4 • إصلاحات الشوائب طفيفة وتحسين واجهة
da: Version 3.2.4 18 januar 2025 • Mindre fejl rettet og forbedringer af brugerflade
de: Version 3.2.4 18. Januar 2025 • Kleinere Fehlerbehebungen und Verbesserungen der Benutzeroberfläche
es: Versión 3.2.4 18 de enero 2025 • Corrección de errores menores y mejoras en la interfaz
fr: Version 3.2.4 18 janvier 2025 • Corrections de bugs mineurs et amélioration de l'interface
hu: 3.2.4-es verzió 2025 Január 18 • Kisebb hibajavítások és fejlesztések a felületen
id: Versi 3.2.4 • Perbaikan bug minor dan perbaikan antarmuka
it: Versione 3.2.4 18 gennaio 2025 • Correzioni di bug minori e miglioramenti dell'interfaccia
ja: バージョン 3.2.4 2025年1月18日 • 軽微なバグの修正とインタフェースの改善
nl: Versie 3.2.4 18 januari 2025 • Kleine foutjes hersteld en verbetering van de interface
pl: Wersja 3.2.4 18 stycznia 2025 • Poprawki drobnych błędów i ulepszenia interfejsu
ru: Версия 3.2.4 18 января 2025 • Исправление незначительных ошибок и улучшения интерфейса
sv: Version 3.2.4 18 januari 2025 • Mindre bugfixar och förbättringar av gränssnittet
zh_hans: 版本 3.2.4 2025年1月18日 • 小错误修复和界面改进
zh_hant: 版本 3.2.4 2025年1月18日 • 小型錯誤修正及介面改進

# v3.2.5_text
source: Version 3.2.5 February 17, 2025 • Minor bug fixes and improvements of the interface
ar: الإصدار 3.2.5 • إصلاحات الشوائب طفيفة وتحسين واجهة
da: Version 3.2.5 17 februar 2025 • Mindre fejl rettet og forbedringer af brugerflade
de: Version 3.2.5 17. Februar 2025 • Kleinere Fehlerbehebungen und Verbesserungen der Benutzeroberfläche
es: Versión 3.2.5 17 de febrero de 2025 • Corrección de errores menores y mejoras en la interfaz
fr: Version 3.2.5 17 février 2025 • Corrections de bugs mineurs et amélioration de l'interface
hu: 3.2.5-es verzió 2025 Február 17 • Kisebb hibajavítások és fejlesztések a felületen
id: Versi 3.2.5 • Perbaikan bug minor dan perbaikan antarmuka
it: Versione 3.2.5 17 febbraio 2025 • Correzioni di bug minori e miglioramenti dell'interfaccia
ja: バージョン 3.2.5 2025年2月17日 • 軽微なバグの修正とインタフェースの改善
nl: Versie 3.2.5 17 februari 2025 • Kleine foutjes hersteld en verbetering van de interface
pl: Wersja 3.2.5 17 lutego 2025 • Poprawki drobnych błędów i ulepszenia interfejsu
ru: Версия 3.2.5 17 февраля 2025 • Исправление незначительных ошибок и улучшения интерфейса
sv: Version 3.2.5 17 februari 2025 • Mindre bugfixar och förbättringar av gränssnittet
zh_hans: 版本 3.2.5 2025年2月17日 • 小错误修复和界面改进
zh_hant: 版本 3.2.5 2025年2月17日 • 小型錯誤修正及介面改進

# v3.3.0_text
source: Version 3.3 March 26, 2025 • Copies and moves a selection of photos much more quickly • Improved management of database migration • Corrects photo and video sharing rights management • Fixes bugs and improves the interface
ar: الإصدار 3.3 26 مارس 2025 - نسخ مجموعة مختارة من الصور ونقلها بسرعة أكبر بكثير - تحسين إدارة ترحيل قاعدة البيانات - تصحيح إدارة حقوق مشاركة الصور والفيديو - إصلاح الأخطاء وتحسين الواجهة
da: Version 3.3 26 marts 2025 • Kopierer og flytter et udvalg af fotos meget hurtigere • Forbedret styring af databasemigrering • Retter op på rettighedsstyring af foto- og videodeling • Retter fejl og forbedrer grænsefladen
de: Version 3.3 26. März 2025 • Kopiert und verschiebt eine Auswahl von Fotos viel schneller. • Verbessert die Handhabung der Datenbankmigration. • Korrigiert die Rechteverwaltung für das Teilen von Fotos und Videos. • Korrigiert Fehler und verbessert die Benutzeroberfläche
es: Versión 3.3 26 de marzo de 2025 • Copia y mueve una selección de fotos mucho más rápido • Mejora la gestión de la migración de bases de datos • Corrige la gestión de los derechos de uso compartido de fotos y vídeos • Corrige errores y mejora la interfaz
fr: Version 3.3 26 mars 2025 • Copie et déplace une sélection de photos beaucoup plus rapidement • Améliore la gestion de la migration de la base de données • Corrige la gestion des droits de partage des photos et des vidéos • Corrige des bugs et améliore l'interface
hu: 3.3 verzió 2025 Március 26 • Sokkal gyorsabban másolja és mozgatja a kiválasztott fényképeket • Az adatbázis-migráció jobb kezelése • Javítja a fényképek és videók megosztási jogainak kezelését • Hibák javítása és a kezelőfelület javítása
id: Versi 3.3 26 Maret 2025 • Menyalin dan memindahkan pilihan foto dengan lebih cepat • Memperbaiki manajemen migrasi basis data • Memperbaiki manajemen hak berbagi foto dan video • Memperbaiki bug dan meningkatkan antarmuka
it: Versione 3.3 26 marzo 2025 • Copia e sposta una selezione di foto molto più rapidamente • Migliora la gestione della migrazione del database • Corregge la gestione dei diritti di condivisione di foto e video • Correzione di bug e miglioramento dell'interfaccia
ja: バージョン3.3 2025年3月26日 • 選択した写真のコピーと移動がより迅速になりました。 • データベース移行の管理を改善 • 写真とビデオの共有権管理の修正 • バグの修正とインターフェイスの改善
nl: Versie 3.3 26 maart 2025 • Kopieert en verplaatst een selectie foto's veel sneller • Beter beheer van databasemigratie • Corrigeert het beheer van rechten voor het delen van foto's en video's • Lost bugs op en verbetert de interface
pl: Wersja 3.3 26 marca 2025 • Szybsze kopiowanie i przenoszenie wybranych zdjęć • Poprawiono zarządzanie migracją bazy danych • Poprawiono zarządzanie prawami do udostępniania zdjęć i filmów • Naprawiono błędy i ulepszono interfejs
ru: Версия 3.3 26 марта 2025 • Копирование и перемещение фотографий гораздо быстрее • Улучшено управление миграцией базы данных • Исправление управления правами на совместное использование фотографий и видео • Исправлены ошибки и улучшен интерфейс
sv: Version 3.3 26 mars 2025 • Kopierar och flyttar ett urval av foton mycket snabbare • Förbättrad hantering av databasmigrering • Korrigerar hanteringen av rättigheter för delning av foton och videor • Fixar buggar och förbättrar gränssnittet
zh_hans: 版本 3.3 2025年3月26日 • 更快速地复制和移动所选照片 • 改进了数据库迁移管理 • 修正照片和视频共享权限管理 • 修正错误并改进界面
zh_hant: 版本 3.3 2025年3月26日 • 更快速地複製和移動精選的照片 • 改善資料庫遷移的管理 • 修正照片和視訊分享權限管理 • 修正錯誤並改進介面

# v3.3.1_text
source: Version 3.3.1 March 28, 2025 • Adds video auto-play and loop options • Fixes bugs and improves the interface
ar: الإصدار 3.3.1 • يضيف خاصية التشغيل التلقائي للفيديو وخيارات الحلقة • إصلاح الأخطاء وتحسين الواجهة
da: Version 3.3.1 28 marts 2025 • Tilføjer automatisk videoafspilning og looping-muligheder • Retter fejl og forbedrer brugerfladen
de: Version 3.3.1 28. März 2025 • Fügt Optionen für die automatische Wiedergabe und die Schleifenwiedergabe von Videos hinzu • Behebt Fehler und verbessert die Benutzeroberfläche
es: Versión 3.3.1 28 de marzo de 2025 • Añade opciones de reproducción automática y vídeo en bucle • Corrección de errores y mejoras en la interfaz
fr: Version 3.3.1 28 mars 2025 • Ajoute des options de lecture automatique et de lecture en boucle des vidéos • Corrige des bugs et améliore l'interface
hu: 3.3.1 verzió 2025 Március 28 • Videó automatikus lejátszási és looping opciók hozzáadása • Hibajavítások és a kezelőfelület javítása
id: Versi 3.3.1 • Menambahkan opsi pemutaran otomatis dan pengulangan video • Memperbaiki bug dan meningkatkan antarmuka
it: Versione 3.3.1 28 marzo 2025 • Aggiunge le opzioni di riproduzione automatica e looping dei video • Corregge i bug e migliora l'interfaccia
ja: バージョン3.3.1 2025年3月28日 • ビデオの自動再生とループのオプションを追加しました。 • バグの修正とインターフェイスの改善
nl: Versie 3.3.1 28 maart 2025 • Opties voor automatisch afspelen en loopen van video toegevoegd • Lost bugs op en verbetert de interface
pl: Wersja 3.3.1 28 marca 2025 • Dodano opcje automatycznego odtwarzania i zapętlania filmów • Naprawiono błędy i ulepszono interfejs
ru: Версия 3.3.1 28 марта 2025 • Добавлены опции автовоспроизведения и зацикливания видео • Исправлены ошибки и улучшен интерфейс
sv: Version 3.3.1 28 mars 2025 • Lägger till alternativ för automatisk uppspelning och looping av video • Fixar buggar och förbättrar gränssnittet
zh_hans: 版本 3.3.1 2025年3月28日 • 添加视频自动播放和循环播放选项 • 修正错误并改进界面
zh_hant: 版本 3.3.1 2025年3月28日 • 新增視訊自動播放與循環選項 • 修正錯誤並改進介面

# v3.3.2_text
source: Version 3.3.2 April 14, 2025 • Fixes bugs and improves the interface
ar: الإصدار 3.3.2 • إصلاح الأخطاء وتحسين الواجهة
da: Version 3.3.2 14 april 2025 • Retter fejl og forbedrer brugerfladen
de: Version 3.3.2 14. April 2025 • Behebt Fehler und verbessert die Benutzeroberfläche
es: Versión 3.3.2 14 de abril de 2025 • Corrección de errores y mejoras en la interfaz
fr: Version 3.3.2 14 avril 2025 • Corrige des bugs et améliore l'interface
hu: 3.3.2 verzió 2025 Április 14 • Hibajavítások és a kezelőfelület javítása
it: Versione 3.3.2 14 aprile 2025 • Corregge i bug e migliora l'interfaccia
ja: バージョン3.3.2 2025年4月14日 • バグの修正とインターフェイスの改善
nl: Versie 3.3.2 14 april 2025 • Lost bugs op en verbetert de interface
pl: Wersja 3.3.2 14 kwietnia 2025 • Naprawiono błędy i ulepszono interfejs
ru: Версия 3.3.2 14 апреля 2025 • Исправлены ошибки и улучшен интерфейс
sv: Version 3.3.2 14 april 2025 • Fixar buggar och förbättrar gränssnittet
zh_hans: 版本 3.3.2 2025年4月14日 • 修正错误并改进界面
zh_hant: 版本 3.3.2 2025年4月14日 • 修正錯誤並改進介面

# v3.4.0_text
source: Version 3.4 June 30, 2025 • Adds options for modifying file names before upload • Fixes bugs and improves the interface
ar: الإصدار 3.4 30 حزيران/يونيه 2025 • يضيف خيارات لتعديل أسماء الملفات قبل تحميل • إصلاح الأخطاء وتحسين الواجهة
da: Version 3.4 30 juni 2025 • Tilføjer muligheder for at ændre filnavne før upload • Retter fejl og forbedrer grænsefladen
de: Version 3.4 30. Juni 2025 • Hinzufügen von Optionen zum Ändern von Dateinamen vor dem Hochladen • Behebung von Fehlern und Verbesserung der Benutzeroberfläche
es: Versión 3.4 30 de junio 2025 • Añade opciones para modificar los nombres de archivos antes de subirlos • Corrige errores y mejora la interfaz
fr: Version 3.4 30 juin 2025 • Ajoute des options pour modifier les noms de fichiers avant transfert • Corrige des bugs et améliore l'interface
hu: 3.4 verzió 2025 Június 30 • Fájlnevek feltöltés előtti módosításának lehetőségei • Hibajavítások és a kezelőfelület javítása
it: Versione 3.4 30 giugno 2025 • Aggiunge opzioni per modificare i nomi dei file prima del caricamento • Correzione di bug e miglioramento dell'interfaccia
ja: バージョン3.4 2025年6月30日 • アップロード前にファイル名を修正するオプションを追加 • バグの修正とインターフェイスの改善
nl: Versie 3.4 30 juni 2025 • Opties toegevoegd voor het wijzigen van bestandsnamen vóór het uploaden • Lost bugs op en verbetert de interface
pl: Wersja 3.4 30 czerwca 2025 • Dodaje opcje modyfikowania nazw plików przed przesłaniem • Poprawki błędów i usprawnienia interfejsu
ru: Версия 3.4 30 июня 2025 • Добавляет опции для изменения имен файлов перед загрузкой • Исправлены ошибки и улучшен интерфейс
sv: Version 3.4 30 juni 2025 • Lägger till alternativ för att ändra filnamn före uppladdning • Fixar buggar och förbättrar gränssnittet
zh_hans: 版本 3.4 2025年6月30日 • 添加上传前修改文件名的选项 • 修正错误并改进界面
zh_hant: 版本 3.4 2025年6月30日 • 新增上傳前修改檔案名稱的選項 • 修正錯誤並改進介面

# v3.4.1_text
source: Version 3.4.1 July 26, 2025 • Adds Home screen quick actions • Fixes bugs and improves the interface
ar: الإصدار 3.4.1 26 يوليو 2025 • يضيف إجراءات سريعة للشاشة الرئيسية • يصلح الأخطاء ويحسن واجهة
da: Version 3.4.1 26 juli 2025 • Tilføjer hurtig handling på startskærmen • Løser fejl og forbedrer brugerflade
de: Version 3.4.1 26. Juli 2025 • Fügt Schnellaktionen für den Startbildschirm hinzu • Behebung von Fehlern und Verbesserung der Benutzeroberfläche
es: Versión 3.4.1 26 de julio de 2025 • Añade acciones rápidas en la pantalla de inicio • Corrige errores y mejora la interfaz
fr: Version 3.4.1 26 juillet 2025 • Ajoute des actions rapides sur l'écran d'accueil • Corrige les bugs et améliore l'interface
hu: 3.4.1 verzió 2025. július 26. • Hozzáadja a kezdőképernyő gyors műveleteit • Hibák javítása és a felület javítása
id: Versi 3.4.1 26 Juli 2025 • Menambahkan tindakan cepat layar Beranda • Memperbaiki bug dan meningkatkan antarmuka
it: Versione 3.4.1 26 luglio 2025 • Aggiunge le azioni rapide della schermata iniziale • Corregge i bug e migliora l'interfaccia
ja: バージョン3.4.1 2025年7月26日 • ホーム画面のクイックアクションを追加 • バグの修正とインターフェイスの改善
nl: Versie 3.4.1 26 juli 2025 • Voegt startscherm snelle acties toe • Verbetert bugs en verbetert de interface
pl: Wersja 3.4.1 26 lipca 2025 r. • Dodano szybkie akcje na ekranie głównym • Naprawiono błędy i ulepszono interfejs
ru: Версия 3.4.1 26 июля 2025 г. • Добавляет быстрые действия на главном экране • Исправлены ошибки и улучшен интерфейс
sv: Version 3.4.1 26 juli 2025 • Lägger till snabbåtgärder på startskärmen • Fixar buggar och förbättrar gränssnittet
zh_hans: 版本 3.4.1 2025年7月26日 • 添加主屏幕快速操作 • 修复错误并改进界面
zh_hant: 版本 3.4.1 2025年7月26日 • 新增主畫面快速動作 • 修正錯誤並改進介面

# v3.5.0_text
source: Version 3.5 August 18, 2025 • Adds PDF file management • Fixes bugs and improves the interface
ar: الإصدار 3.5 18 أغسطس 2025 • يضيف إدارة ملفات PDF • إصلاح الأخطاء وتحسين الواجهة
da: Version 3.5 18 august 2025 • Tilføjer PDF-filhåndtering • Rette fejl og forbedrer grænsefladen
de: Version 3.5 18. August 2025 • Fügt PDF-Dateiverwaltung hinzu • Behebung von Fehlern und Verbesserung der Benutzeroberfläche
es: Versión 3.5 18 de agosto de 2025 • Añade gestión de archivos PDF. • Corrige errores y mejora la interfaz
fr: Version 3.5 18 août 2025 • Ajoute la gestion des fichiers PDF • Corrige des bugs et améliore l'interface
hu: 3.5-ös verzió 2025. augusztus 18. • PDF-fájlok kezelésének hozzáadása • Hibajavítások és a kezelőfelület javítása
id: Versi 3.5 18 Agustus 2025 • Menambahkan pengelolaan file PDF • Memperbaiki bug dan meningkatkan antarmuka
it: Versione 3.5 18 agosto 2025 • Aggiunge la gestione dei file PDF • Corregge bug e migliora l'interfaccia
ja: バージョン 3.5 2025年8月18日 • PDF ファイルの管理機能を追加 • バグの修正とインターフェイスの改善
nl: Versie 3.5 18 augustus 2025 • Voegt PDF-bestandsbeheer toe • Verhelpt bugs en verbetert de interface
pl: Wersja 3.5 18 sierpnia 2025 r. • Dodano zarządzanie plikami PDF • Poprawki błędów i usprawnienia interfejsu
ru: Версия 3.5 18 августа 2025 г. • Добавлено управление файлами PDF. • Исправлены ошибки и улучшен интерфейс
sv: Version 3.5 18 augusti 2025 • Lägger till hantering av PDF-filer • Fixar buggar och förbättrar gränssnittet
zh_hans: 版本 3.5 2025年8月18日 • 添加 PDF 文件管理功能 • 修复了 bug 并改进了界面
zh_hant: 版本 3.5 2025年8月18日 • 新增 PDF 檔案管理 • 修正錯誤並改進介面

# v3.5.1_text
source: Version 3.5.1 August 23, 2025 • Fixes bugs and improves the interface
ar: الإصدار 3.5.1 23 أغسطس 2025 • إصلاح الأخطاء وتحسين الواجهة
da: Version 3.5.1 23 august 2025 • Rette fejl og forbedrer grænsefladen
de: Version 3.5.1 23. August 2025 • Fehlerbehebungen
es: Versión 3.5.1 23 de agosto de 2025 • Corrección de errores
fr: Version 3.5.1 23 août 2025 • Corrige des bugs et améliore l'interface
hu: 3.5.1-es verzió 2025. augusztus 23. • Hibajavítások és a kezelőfelület javítása
id: Versi 3.5.1 23 Agustus 2025 • Memperbaiki bug dan meningkatkan antarmuka
it: Versione 3.5.1 23 agosto 2025 • Corregge bug e migliora l'interfaccia
ja: バージョン 3.5.1 2025年8月23日 • バグの修正とインターフェイスの改善
nl: Versie 3.5.1 23 augustus 2025 • Verhelpt bugs en verbetert de interface
pl: Wersja 3.5.1 23 sierpnia 2025 r. • Poprawki błędów i usprawnienia interfejsu
ru: Версия 3.5.1 23 августа 2025 г. • Исправлены ошибки и улучшен интерфейс
sv: Version 3.5.1 23 augusti 2025 • Fixar buggar och förbättrar gränssnittet
zh_hans: 版本 3.5.1 2025年8月23日 • 修复了 bug 并改进了界面
zh_hant: 版本 3.5.1 2025年8月23日 • 修正錯誤並改進介面
